---
kind: method
id: M:Autodesk.Revit.DB.Edge.AsCurve
source: html/4d780a44-c713-036f-840f-605527bbb2ce.htm
---
# Autodesk.Revit.DB.Edge.AsCurve Method

Returns a curve that corresponds to the edge's parametric orientation.

## Syntax (C#)
```csharp
public Curve AsCurve()
```

## Returns
It can be an Arc, Line, or HermiteSpline.